## 30910_안윤지_0819_1

# 데이터 프레임의 세계로!
## 데이터 프레임 만들기 - 시험 성적 데이터를 말들어 보자!
### 데이터 임력해 데이터 프레임 만들기

In [1]:
# pandas

import pandas as pd

In [2]:
# data frame 만들기
# data frame 변수 = df 

df = pd.DataFrame({'name' : ['김지후','이유진','박동현','김민지'],
                  'english' : [90,80,60,70],
                  'math' : [50,60,100,20]})

In [3]:
df

  name  english  math
0  김지후       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [5]:
# 특정 변수의 값을 추출하기
# 영어 점수만 출력해보자
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

In [6]:
# 수학 점수만 출력
df['math']

0     50
1     60
2    100
3     20
Name: math, dtype: int64

In [8]:
# 변수의 값으로 합계구하기
#sum

sum(df['english'])

300

In [10]:
# 수학합계
sum(df['math'])

# 과목별 평균

print(sum(df['english'])/4)
print(sum(df['math'])/4)

75.0
57.5

## 외부 데이터 이용하기 - 축적된 시험 성적 데이터를 불러오자!
### 엑셀 파일 불러오기
#### 1. 엑셀 파일 살펴보기
#### 2. 위켕 디렉터리에 엑셀 파일 삽입하기
#### 3. 엑셀파일 불러오기

In [15]:
# 외부파일 불러오는 메소드 read_excel('디랙토리/파일명')
# 변수에 할당
df_exam = pd.read_excel('excel_exam.xlsx')
df_exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [37]:
# 문제 영어 점수 합계를 구하시오
# 문제 영어 점수 평균를 구하시오

print('영어 점수 합계', sum(df_exam['english']))
print('영어 점수 평균', sum(df_exam['english'])/len(df_exam))
print('수학 점수 합계', sum(df_exam['math']))
print('수학 점수 평균', sum(df_exam['math'])/len(df_exam))
print('과학 점수 합계', sum(df_exam['science']))
print('과학 점수 평균', sum(df_exam['science'])/len(df_exam))

영어 점수 합계 1698
영어 점수 평균 84.9
수학 점수 합계 1149
수학 점수 평균 57.45
과학 점수 합계 1189
과학 점수 평균 59.45

In [29]:
sales = pd.DataFrame({'제품' : ['사과','딸기','수박'],
              '가격' : [1800,1500,3000],
              '판매량' : [24,38,13]})
sales

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [35]:
print('가격의 평균 : ', sum(sales['가격'])/len(sales))
print('판매량의 평균 : ', sum(sales['판매량'])/len(sales))

가격의 평균 :  2100.0
판매량의 평균 :  25.0

In [33]:
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [34]:
len(x)

5

In [42]:
df_exam_novar = pd.read_excel('excel_exam_novar.xlsx',header = None) # 머리글이 없을때 옵션 header = none
df_exam_novar

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15
5  6  3  50  98  45
6  7  4  46  98  65
7  8  4  48  87  12

# 엑셀 파일에 시트가 여러 개 있다면?

In [56]:
# Sheet2 시트의 데이터 불러오기
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 'Sheet2')

# 세번째 시트의 데이터 불러오기
df_exam = pd.read_excel('excel_exam.xlsx', sheet_name = 2)